stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_adc.c
  /* Enable ADC deep power down mode */
  LL_ADC_EnableDeepPowerDown(hadc->Instance);

  /* Note: HAL ADC deInit is done independently of ADC conversion stop        */
  /*       and disable return status. In case of status fail, attempt to      */
  /*       perform deinitialization anyway and it is up user code in          */
  /*       in HAL_ADC_MspDeInit() to reset the ADC peripheral using           */
  /*       system RCC hard reset.                                             */

  /* ========== Reset ADC registers ========== */
  /* Reset register IER */
  __HAL_ADC_DISABLE_IT(hadc, (ADC_IT_AWD3  | ADC_IT_AWD2 | ADC_IT_AWD1 |
                              ADC_IT_LDORDY |
                              ADC_IT_JQOVF | ADC_IT_OVR  |
                              ADC_IT_JEOS  | ADC_IT_JEOC |
                              ADC_IT_EOS   | ADC_IT_EOC  |
                              ADC_IT_EOSMP | ADC_IT_RDY));

  /* Reset register ISR */
  __HAL_ADC_CLEAR_FLAG(hadc, (ADC_FLAG_AWD3  | ADC_FLAG_AWD2 | ADC_FLAG_AWD1 |
                              ADC_FLAG_LDORDY |
                              ADC_FLAG_JQOVF | ADC_FLAG_OVR  |
                              ADC_FLAG_JEOS  | ADC_FLAG_JEOC |
                              ADC_FLAG_EOS   | ADC_FLAG_EOC  |
                              ADC_FLAG_EOSMP | ADC_FLAG_RDY));

  /* Reset register CR */
  /* Bits ADC_CR_JADSTP, ADC_CR_ADSTP, ADC_CR_JADSTART, ADC_CR_ADSTART,
     ADC_CR_ADCAL, ADC_CR_ADDIS and ADC_CR_ADEN are in access mode "read-set":
     no direct reset applicable.
     Update CR register to reset value where doable by software */
  SET_BIT(hadc->Instance->CR, ADC_CR_DEEPPWD);

  /* Reset register CFGR1 */
  CLEAR_BIT(hadc->Instance->CFGR1, ADC_CFGR1_AWD1CH  | ADC_CFGR1_JAUTO |
            ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN  | ADC_CFGR1_AWD1SGL | ADC_CFGR1_JDISCEN |
            ADC_CFGR1_DISCNUM | ADC_CFGR1_DISCEN  | ADC_CFGR1_AUTDLY  |
            ADC_CFGR1_CONT    | ADC_CFGR1_OVRMOD  |
            ADC_CFGR1_EXTEN   | ADC_CFGR1_EXTSEL  |
            ADC_CFGR1_RES     | ADC_CFGR1_DMNGT | ADC_CFGR1_JQM);
  SET_BIT(hadc->Instance->CFGR1, ADC_CFGR1_JQDIS);

  /* Reset register CFGR2 */
  CLEAR_BIT(hadc->Instance->CFGR2, ADC_CFGR2_SMPTRIG |
            ADC_CFGR2_LFTRIG  | ADC_CFGR2_LSHIFT |
            ADC_CFGR2_SWTRIG  | ADC_CFGR2_BULB  |
            ADC_CFGR2_ROVSM   | ADC_CFGR2_TROVS | ADC_CFGR2_OVSS |
            ADC_CFGR2_OVSR    | ADC_CFGR2_JOVSE | ADC_CFGR2_ROVSE);

  /* Reset register SMPR1 */
  CLEAR_BIT(hadc->Instance->SMPR1, ADC_SMPR1_FIELDS);

  /* Reset register SMPR2 */
  CLEAR_BIT(hadc->Instance->SMPR2,
            ADC_SMPR2_SMP18 | ADC_SMPR2_SMP17 | ADC_SMPR2_SMP16 |
            ADC_SMPR2_SMP15 | ADC_SMPR2_SMP14 | ADC_SMPR2_SMP13 |
            ADC_SMPR2_SMP12 | ADC_SMPR2_SMP11 | ADC_SMPR2_SMP10);

  /* Reset registers of AWD1 thresholds */
  CLEAR_BIT(hadc->Instance->AWD1LTR, ADC_AWD1LTR_LTR);
  MODIFY_REG(hadc->Instance->AWD1HTR,
             ADC_AWD1HTR_AWDFILT | ADC_AWD1HTR_HTR,
             ADC_AWD1HTR_HTR & (~(ADC_AWD1HTR_AWDFILT | ADC_AWD1HTR_HTR_22)));

  /* Reset registers of AWD2 thresholds */
  CLEAR_BIT(hadc->Instance->AWD2LTR, ADC_AWD2LTR_LTR);
  MODIFY_REG(hadc->Instance->AWD2HTR,
             ADC_AWD2HTR_HTR,
             ADC_AWD2HTR_HTR & (~(ADC_AWD2HTR_HTR_22)));

  /* Reset registers of AWD3 thresholds */
  CLEAR_BIT(hadc->Instance->AWD3LTR, ADC_AWD3LTR_LTR);
  MODIFY_REG(hadc->Instance->AWD3HTR,
             ADC_AWD3HTR_HTR,
             ADC_AWD3HTR_HTR & (~(ADC_AWD3HTR_HTR_22)));

  /* Reset register SQR1 */
  CLEAR_BIT(hadc->Instance->SQR1, ADC_SQR1_SQ4 | ADC_SQR1_SQ3 | ADC_SQR1_SQ2 |
            ADC_SQR1_SQ1 | ADC_SQR1_L);

  /* Reset register SQR2 */
  CLEAR_BIT(hadc->Instance->SQR2, ADC_SQR2_SQ9 | ADC_SQR2_SQ8 | ADC_SQR2_SQ7 |
            ADC_SQR2_SQ6 | ADC_SQR2_SQ5);

  /* Reset register SQR3 */
  CLEAR_BIT(hadc->Instance->SQR3, ADC_SQR3_SQ14 | ADC_SQR3_SQ13 | ADC_SQR3_SQ12 |
            ADC_SQR3_SQ11 | ADC_SQR3_SQ10);

  /* Reset register SQR4 */
  CLEAR_BIT(hadc->Instance->SQR4, ADC_SQR4_SQ16 | ADC_SQR4_SQ15);

  /* Register JSQR was reset when the ADC was disabled */

  /* Reset register DR */
  /* bits in access mode read only, no direct reset applicable*/

  /* Reset register OFR1 */
  CLEAR_BIT(hadc->Instance->OFCFGR1, ADC_OFCFGR1_SSAT | ADC_OFCFGR1_OFFSET_CH | ADC_OFCFGR1_USAT | ADC_OFCFGR1_POSOFF);
  CLEAR_BIT(hadc->Instance->OFR1, ADC_OFR1_OFFSET);
  /* Reset register OFR2 */
  CLEAR_BIT(hadc->Instance->OFCFGR2, ADC_OFCFGR2_SSAT | ADC_OFCFGR2_OFFSET_CH | ADC_OFCFGR1_USAT | ADC_OFCFGR2_POSOFF);
  CLEAR_BIT(hadc->Instance->OFR2, ADC_OFR2_OFFSET);
  /* Reset register OFR3 */
  CLEAR_BIT(hadc->Instance->OFCFGR3, ADC_OFCFGR3_SSAT | ADC_OFCFGR3_OFFSET_CH | ADC_OFCFGR1_USAT | ADC_OFCFGR3_POSOFF);
  CLEAR_BIT(hadc->Instance->OFR3, ADC_OFR3_OFFSET);
  /* Reset register OFR4 */
  CLEAR_BIT(hadc->Instance->OFCFGR4, ADC_OFCFGR4_SSAT | ADC_OFCFGR4_OFFSET_CH | ADC_OFCFGR1_USAT | ADC_OFCFGR4_POSOFF);
  CLEAR_BIT(hadc->Instance->OFR4, ADC_OFR4_OFFSET);

  /* Reset register GCOMP */
  CLEAR_BIT(hadc->Instance->GCOMP, ADC_GCOMP_GCOMP | ADC_GCOMP_GCOMPCOEFF);
  SET_BIT(hadc->Instance->GCOMP, ADC_GCOMP_GCOMPCOEFF_12);

  /* Reset registers JDR1, JDR2, JDR3, JDR4 */
  /* bits in access mode read only, no direct reset applicable*/

  /* Reset register AWD2CR */
  CLEAR_BIT(hadc->Instance->AWD2CR, ADC_AWD2CR_AWD2CH);

  /* Reset register AWD3CR */
  CLEAR_BIT(hadc->Instance->AWD3CR, ADC_AWD3CR_AWD3CH);


  /* Reset register PCSEL */
  CLEAR_BIT(hadc->Instance->PCSEL, ADC_PCSEL_PCSEL);

  /* Reset register CALFACT */
  CLEAR_BIT(hadc->Instance->CALFACT, ADC_CALFACT_CALFACT);

  /* Reset register OR */
  CLEAR_BIT(hadc->Instance->OR, ADC_OR_VDDCOREEN);

  /* ========== Reset common ADC registers ========== */

  /* Software is allowed to change common parameters only when all the other
     ADCs are disabled.   */
  if (__LL_ADC_IS_ENABLED_ALL_COMMON_INSTANCE(__LL_ADC_COMMON_INSTANCE(hadc->Instance)) == 0UL)
  {
    /* Reset configuration of ADC common register CCR:
      - clock mode: CKMODE, PRESCEN
      - multimode related parameters (when this feature is available): MDMA,
        DMACFG, DELAY, DUAL (set by HAL_ADCEx_MultiModeConfigChannel() API)
      - internal measurement paths: Vbat, temperature sensor, Vref (set into
        HAL_ADC_ConfigChannel() or HAL_ADCEx_InjectedConfigChannel() )
    */
    ADC_CLEAR_COMMON_CONTROL_REGISTER(hadc);
  }

  /* ========== Hard reset ADC peripheral ========== */
  /* Performs a global reset of the entire ADC peripherals instances        */
  /* sharing the same common ADC instance: ADC state is forced to           */
  /* a similar state as after device power-on.                              */
  /* Note: A possible implementation is to add RCC bus reset of ADC         */
  /* (for example, using macro                                              */
  /*  __HAL_RCC_ADC..._FORCE_RESET()/..._RELEASE_RESET()/..._CLK_DISABLE()) */
  /* in function "void HAL_ADC_MspDeInit(ADC_HandleTypeDef *hadc)":         */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
  if (hadc->MspDeInitCallback == NULL)
  {
    hadc->MspDeInitCallback = HAL_ADC_MspDeInit; /* Legacy weak MspDeInit  */
  }

